Output from `terraform plan`
```
                              - "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          - JobName   = "unprocessed-files-check-dps-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Resume DMS Replication Task"                 = {
                      - Next       = "Start Glue Streaming Job"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:C52H2ZTNE5CVLJLXR7R6QOYYQE"
                          - StartReplicationTaskType = "resume-processing"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Curated Zone"          = {
                      - Next       = "Run Vacuum Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-compaction-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Structured Zone"       = {
                      - Next       = "Run Vacuum Job on Structured Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-compaction-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Curated Zone"              = {
                      - Next       = "Resume DMS Replication Task"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-retention-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Structured Zone"           = {
                      - Next       = "Run Compaction Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-retention-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Streaming Job"                    = {
                      - End        = true
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "dps-activities"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-cdc-dps-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Stop DMS Replication Task"                   = {
                      - Next       = "Check All Pending Files Have Been Processed"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.dms.replication.task.id" = "dpr-dms-dps-postgres-s3-dps-activities-task-preproduction"
                            }
                          - JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop Glue Streaming Job"                     = {
                      - Next       = "Run Compaction Job on Structured Zone"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-dps-activities-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-maintenance-pipeline-dps-dps-activities-preproduction"
        name          = "dpr-maintenance-pipeline-dps-dps-activities-preproduction"
        tags          = {
            "Domain"         = "dps-activities"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.reload-pipeline["dps-activities"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
            {
              - Comment = "Reload Pipeline Step Function"
              - StartAt = "Deactivate Archive Trigger"
              - States  = {
                  - "Archive Remaining Raw Files"                          = {
                      - Next       = "Update Hive Tables"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "dps-activities"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"     = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              - "--dpr.file.transfer.delete.copied.files" = "true"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Check All Pending Files Have Been Processed"          = {
                      - Next       = "Stop Glue Streaming Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          - JobName   = "unprocessed-files-check-dps-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Copy Curated Data to Temp-Reload Bucket"              = {
                      - Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                            = "dps-activities"
                              - "--dpr.config.s3.bucket"                      = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"         = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                              - "--dpr.file.transfer.delete.copied.files"     = "false"
                              - "--dpr.file.transfer.destination.bucket"      = "dpr-temp-reload-preproduction"
                              - "--dpr.file.transfer.retention.period.amount" = "0"
                              - "--dpr.file.transfer.source.bucket"           = "dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Deactivate Archive Trigger"                           = {
                      - Next       = "Stop Archive Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.glue.trigger.activate" = "false"
                              - "--dpr.glue.trigger.name"     = "dpr-archive-dps-activities-preproduction-trigger"
                            }
                          - JobName   = "dpr-activate-glue-trigger-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Delete Existing Reload Diffs"                         = {
                      - Next       = "Run Create Reload Diff Batch Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                              - "--dpr.file.source.prefix"    = "diffs"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Raw Data"                                       = {
                      - Next       = "Run Compaction Job on Structured Zone"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Raw, Structured and Curated Data"               = {
                      - Next       = "Start DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Temp Reload Bucket Data"                        = {
                      - End        = true
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Invoke DMS State Control Lambda"                      = {
                      - Next           = "Run Glue Batch Job"
                      - Parameters     = {
                          - FunctionName = "dpr-pipeline-notification-function"
                          - Payload      = {
                              - replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:C52H2ZTNE5CVLJLXR7R6QOYYQE"
                              - "token.$"          = "$$.Task.Token"
                            }
                        }
                      - Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      - Retry          = [
                          - {
                              - BackoffRate     = 2
                              - ErrorEquals     = [
                                  - "Lambda.ServiceException",
                                  - "Lambda.AWSLambdaException",
                                  - "Lambda.SdkClientException",
                                  - "Lambda.TooManyRequestsException",
                                ]
                              - IntervalSeconds = 60
                              - MaxAttempts     = 2
                            },
                        ]
                      - TimeoutSeconds = 86400
                      - Type           = "Task"
                    }
                  - "Move Reload Diffs toDelete to Archive Bucket"         = {
                      - Next       = "Move Reload Diffs toUpdate to Archive Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                            = "dps-activities"
                              - "--dpr.config.s3.bucket"                      = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"         = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                              - "--dpr.file.source.prefix"                    = "diffs/toDelete"
                              - "--dpr.file.transfer.delete.copied.files"     = "true"
                              - "--dpr.file.transfer.destination.bucket"      = "dpr-raw-archive-preproduction"
                              - "--dpr.file.transfer.retention.period.amount" = "0"
                              - "--dpr.file.transfer.source.bucket"           = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Move Reload Diffs toInsert to Archive Bucket"         = {
                      - Next       = "Move Reload Diffs toDelete to Archive Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                            = "dps-activities"
                              - "--dpr.config.s3.bucket"                      = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"         = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                              - "--dpr.file.source.prefix"                    = "diffs/toInsert"
                              - "--dpr.file.transfer.delete.copied.files"     = "true"
                              - "--dpr.file.transfer.destination.bucket"      = "dpr-raw-archive-preproduction"
                              - "--dpr.file.transfer.retention.period.amount" = "0"
                              - "--dpr.file.transfer.source.bucket"           = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Move Reload Diffs toUpdate to Archive Bucket"         = {
                      - Next       = "Empty Raw Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                            = "dps-activities"
                              - "--dpr.config.s3.bucket"                      = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"         = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                              - "--dpr.file.source.prefix"                    = "diffs/toUpdate"
                              - "--dpr.file.transfer.delete.copied.files"     = "true"
                              - "--dpr.file.transfer.destination.bucket"      = "dpr-raw-archive-preproduction"
                              - "--dpr.file.transfer.retention.period.amount" = "0"
                              - "--dpr.file.transfer.source.bucket"           = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Prepare Temp Reload Bucket Data"                      = {
                      - Next       = "Copy Curated Data to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Reactivate Archive Trigger"                           = {
                      - Next       = "Empty Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.glue.trigger.activate" = "true"
                              - "--dpr.glue.trigger.name"     = "dpr-archive-dps-activities-preproduction-trigger"
                            }
                          - JobName   = "dpr-activate-glue-trigger-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Resume DMS Replication Task"                          = {
                      - Next       = "Start Glue Streaming Job"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:C52H2ZTNE5CVLJLXR7R6QOYYQE"
                          - StartReplicationTaskType = "resume-processing"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Curated Zone"                   = {
                      - Next       = "Run Vacuum Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-compaction-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Structured Zone"                = {
                      - Next       = "Run Vacuum Job on Structured Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-compaction-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Create Reload Diff Batch Job"                     = {
                      - Next       = "Move Reload Diffs toInsert to Archive Bucket"
                      - Parameters = {
                          - JobName = "dpr-create-reload-diff-dps-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Glue Batch Job"                                   = {
                      - Next       = "Delete Existing Reload Diffs"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "dps-activities"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-batch-dps-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Curated Zone"                       = {
                      - Next       = "Resume DMS Replication Task"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-retention-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Structured Zone"                    = {
                      - Next       = "Run Compaction Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-retention-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start DMS Replication Task"                           = {
                      - Next       = "Invoke DMS State Control Lambda"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:C52H2ZTNE5CVLJLXR7R6QOYYQE"
                          - StartReplicationTaskType = "reload-target"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Start Glue Streaming Job"                             = {
                      - Next       = "Switch Hive Tables for Prisons to Curated"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "dps-activities"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-cdc-dps-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Stop Archive Job"                                     = {
                      - Next       = "Stop DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-archive-dps-activities-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop DMS Replication Task"                            = {
                      - Next       = "Check All Pending Files Have Been Processed"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.dms.replication.task.id" = "dpr-dms-dps-postgres-s3-dps-activities-task-preproduction"
                            }
                          - JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop Glue Streaming Job"                              = {
                      - Next       = "Archive Remaining Raw Files"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-dps-activities-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Curated"            = {
                      - Next       = "Reactivate Archive Trigger"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "dps-activities"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      - Next       = "Empty Raw, Structured and Curated Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "dps-activities"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Update Hive Tables"                                   = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "dps-activities"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-hive-table-creation-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-reload-pipeline-dps-dps-activities-preproduction"
        name          = "dpr-reload-pipeline-dps-dps-activities-preproduction"
        tags          = {
            "Domain"         = "dps-activities"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.replay-pipeline["dps-activities"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
            {
              - Comment = "Replay Pipeline Step Function"
              - StartAt = "Deactivate Archive Trigger"
              - States  = {
                  - "Archive Remaining Raw Files"                          = {
                      - Next       = "Copy Archived Data to Raw Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "dps-activities"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"     = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              - "--dpr.file.transfer.delete.copied.files" = "true"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Check All Files Have Been Replayed"                   = {
                      - Next       = "Empty Raw Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          - JobName   = "unprocessed-files-check-dps-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Check All Pending Files Have Been Processed"          = {
                      - Next       = "Stop Glue Streaming Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.orchestration.wait.interval.seconds" = "60"
                            }
                          - JobName   = "unprocessed-files-check-dps-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Copy Archived Data to Raw Bucket"                     = {
                      - Next       = "Start Glue Batch Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                            = "dps-activities"
                              - "--dpr.config.s3.bucket"                      = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"         = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"       = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"       = "1000"
                              - "--dpr.file.transfer.delete.copied.files"     = "false"
                              - "--dpr.file.transfer.destination.bucket"      = "dpr-raw-zone-preproduction"
                              - "--dpr.file.transfer.retention.period.amount" = "0"
                              - "--dpr.file.transfer.source.bucket"           = "dpr-raw-archive-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Copy Curated Data to Temp-Reload Bucket"              = {
                      - Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "dps-activities"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              - "--dpr.datastorage.retry.maxAttempts"     = "10"
                              - "--dpr.datastorage.retry.maxWaitMillis"   = "10000"
                              - "--dpr.datastorage.retry.minWaitMillis"   = "1000"
                              - "--dpr.file.transfer.delete.copied.files" = "false"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Deactivate Archive Trigger"                           = {
                      - Next       = "Stop Archive Job"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.glue.trigger.activate" = "false"
                              - "--dpr.glue.trigger.name"     = "dpr-archive-dps-activities-preproduction-trigger"
                            }
                          - JobName   = "dpr-activate-glue-trigger-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Raw Data"                                       = {
                      - Next       = "Resume DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Structured and Curated Data"                    = {
                      - Next       = "Archive Remaining Raw Files"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.file.deletion.buckets" = "dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Temp Reload Bucket Data"                        = {
                      - End        = true
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Prepare Temp Reload Bucket Data"                      = {
                      - Next       = "Copy Curated Data to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Reactivate Archive Trigger"                           = {
                      - Next       = "Empty Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.glue.trigger.activate" = "true"
                              - "--dpr.glue.trigger.name"     = "dpr-archive-dps-activities-preproduction-trigger"
                            }
                          - JobName   = "dpr-activate-glue-trigger-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Resume DMS Replication Task"                          = {
                      - Next       = "Switch Hive Tables for Prisons to Curated"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:C52H2ZTNE5CVLJLXR7R6QOYYQE"
                          - StartReplicationTaskType = "resume-processing"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Curated Zone"                   = {
                      - Next       = "Run Vacuum Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-compaction-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Compaction Job on Structured Zone"                = {
                      - Next       = "Run Vacuum Job on Structured Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-compaction-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Curated Zone"                       = {
                      - Next       = "Start Glue Streaming Job"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-curated-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-retention-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Run Vacuum Job on Structured Zone"                    = {
                      - Next       = "Run Compaction Job on Curated Zone"
                      - Parameters = {
                          - Arguments       = {
                              - "--dpr.config.key"            = "dps-activities"
                              - "--dpr.config.s3.bucket"      = "dpr-glue-jobs-preproduction"
                              - "--dpr.maintenance.root.path" = "s3://dpr-structured-zone-preproduction/activities/"
                            }
                          - JobName         = "dpr-maintenance-retention-preproduction"
                          - NumberOfWorkers = 2
                          - WorkerType      = "G.1X"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Batch Job"                                 = {
                      - Next       = "Run Compaction Job on Structured Zone"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "dps-activities"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-batch-dps-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Streaming Job"                             = {
                      - Next       = "Check All Files Have Been Replayed"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.clean.cdc.checkpoint" = "true"
                              - "--dpr.config.key"           = "dps-activities"
                              - "--dpr.config.s3.bucket"     = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-cdc-dps-activities-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Stop Archive Job"                                     = {
                      - Next       = "Stop DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-archive-dps-activities-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop DMS Replication Task"                            = {
                      - Next       = "Check All Pending Files Have Been Processed"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.dms.replication.task.id" = "dpr-dms-dps-postgres-s3-dps-activities-task-preproduction"
                            }
                          - JobName   = "dpr-stop-dms-task-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Stop Glue Streaming Job"                              = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-dps-activities-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Curated"            = {
                      - Next       = "Reactivate Archive Trigger"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "dps-activities"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      - Next       = "Empty Structured and Curated Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "dps-activities"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-dps-dps-activities-preproduction"
        name          = "dpr-replay-pipeline-dps-dps-activities-preproduction"
        tags          = {
            "Domain"         = "dps-activities"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] must be replaced
-/+ resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      ~ endpoint_arn                = "arn:aws:dms:eu-west-2:972272129531:endpoint:QHOIXPOUCXKV76NEK4DOFGZZOGH7FT3TAHXS7UI" -> (known after apply)
      ~ endpoint_id                 = "dpr-dms-dps-pgres-source-endpoint" -> "dpr-dms-dps-activities-pgres-source-endpoint" # forces replacement
      + extra_connection_attributes = (known after apply)
      ~ id                          = "dpr-dms-dps-pgres-source-endpoint" -> (known after apply)
      ~ kms_key_arn                 = "arn:aws:kms:eu-west-2:972272129531:key/230cd1dc-21a5-459a-bd70-e1470e635848" -> (known after apply)
        tags                        = {
            "DMS_Source"     = "dps"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (9 unchanged attributes hidden)

      ~ postgres_settings {
          - capture_ddls                 = false -> null
          - execute_timeout              = 0 -> null
          - fail_tasks_on_lob_truncation = false -> null
          ~ heartbeat_enable             = false -> true
          - heartbeat_frequency          = 0 -> null
          - map_jsonb_as_clob            = false -> null
          - max_file_size                = 0 -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] must be replaced
-/+ resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      - add_trailing_padding_character              = false -> null
      - cdc_min_file_size                           = 0 -> null
      + certificate_arn                             = (known after apply)
      - data_page_size                              = 0 -> null
      - dict_page_size_limit                        = 0 -> null
      ~ endpoint_arn                                = "arn:aws:dms:eu-west-2:972272129531:endpoint:QGA75WFQ2MOKIJUIKM5MCN625T6VL4FHCJDFMUY" -> (known after apply)
      ~ endpoint_id                                 = "dpr-dms-dps-s3-target-endpoint" -> "dpr-dms-dps-activities-s3-target-endpoint" # forces replacement
      ~ engine_display_name                         = "Amazon S3" -> (known after apply)
      + external_id                                 = (known after apply)
      ~ id                                          = "dpr-dms-dps-s3-target-endpoint" -> (known after apply)
      - ignore_header_rows                          = 0 -> null
      + kms_key_arn                                 = (known after apply)
      - row_group_length                            = 0 -> null
      ~ service_access_role_arn                     = "arn:aws:iam::972272129531:role/dpr-dms-dps-s3-endpoint-role" -> (known after apply)
      ~ ssl_mode                                    = "none" -> (known after apply)
      ~ status                                      = "active" -> (known after apply)
        tags                                        = {
            "DMS_Source"     = "dps"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Target Endpoint"
            "Service_Bundle" = "true"
        }
        # (23 unchanged attributes hidden)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] must be replaced
-/+ resource "aws_iam_policy" "dms-operator-s3-policy" {
      ~ arn              = "arn:aws:iam::972272129531:policy/dpr-dms-dps-operator-s3-target-policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::972272129531:policy/dpr-dms-dps-operator-s3-target-policy" -> (known after apply)
      ~ name             = "dpr-dms-dps-operator-s3-target-policy" -> "dpr-dms-dps-activities-operator-s3-target-policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPA6EX7PKX5VC6R4USI7" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] must be replaced
-/+ resource "aws_iam_policy" "dms-s3-target-policy" {
      ~ arn              = "arn:aws:iam::972272129531:policy/dpr-dms-dps-s3-target-policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::972272129531:policy/dpr-dms-dps-s3-target-policy" -> (known after apply)
      ~ name             = "dpr-dms-dps-s3-target-policy" -> "dpr-dms-dps-activities-s3-target-policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPA6EX7PKX55FAFS3OHT" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] must be replaced
-/+ resource "aws_iam_role" "dms-operator-s3-target-role" {
      ~ arn                   = "arn:aws:iam::972272129531:role/dpr-dms-dps-operator-s3-target-role" -> (known after apply)
      ~ create_date           = "2024-03-05T11:45:22Z" -> (known after apply)
      ~ id                    = "dpr-dms-dps-operator-s3-target-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::972272129531:policy/dpr-dms-dps-operator-s3-target-policy",
        ] -> (known after apply)
      ~ name                  = "dpr-dms-dps-operator-s3-target-role" -> "dpr-dms-dps-activities-operator-s3-target-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA6EX7PKX5YFHEN7OUH" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] must be replaced
-/+ resource "aws_iam_role" "dms-s3-role" {
      ~ arn                   = "arn:aws:iam::972272129531:role/dpr-dms-dps-s3-endpoint-role" -> (known after apply)
      ~ create_date           = "2024-03-05T11:45:22Z" -> (known after apply)
      ~ id                    = "dpr-dms-dps-s3-endpoint-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::972272129531:policy/dpr-dms-dps-s3-target-policy",
        ] -> (known after apply)
      ~ name                  = "dpr-dms-dps-s3-endpoint-role" -> "dpr-dms-dps-activities-s3-endpoint-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA6EX7PKX5VC5T36Y7K" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      ~ id         = "dpr-dms-dps-operator-s3-target-role-20240305114522372700000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::972272129531:policy/dpr-dms-dps-operator-s3-target-policy" # forces replacement -> (known after apply)
      ~ role       = "dpr-dms-dps-operator-s3-target-role" -> "dpr-dms-dps-activities-operator-s3-target-role" # forces replacement
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      ~ id         = "dpr-dms-dps-s3-endpoint-role-20240305114522468500000005" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::972272129531:policy/dpr-dms-dps-s3-target-policy" # forces replacement -> (known after apply)
      ~ role       = "dpr-dms-dps-s3-endpoint-role" -> "dpr-dms-dps-activities-s3-endpoint-role" # forces replacement
    }

Plan: 9 to add, 198 to change, 9 to destroy.

```